var arrLang = {
    'ua' : {
        // Изменить кнопку языка
        'changelanguage' : 'UA',
        // Навигация
        'main' : 'Головна',
        'ofsuccess' : 'Арифметика успіху',
        'achievements' : 'Наші досягнення',
        'contacts' : 'Контакти',
        'map' : 'Мапа',
        // Хедер
        'weinsocial' : 'Ми у соціальних мережах',
        'today' : 'Cьогодні інновація -',
        'tomorrow' : 'завтра необхідність',
        'energy' : 'Енергозбереження нового покоління',
        // Арифметика успеха
        'territory' : 'Територія підприємства',
        'onthemarket' : 'на ринку ',
        'sevenyears' : '7 років',
        'theyearof' : 'Річний обсяг виробництва',
        // Сертификаты качества и премии
        'cert' : 'Сертифікати якості та премії',
        'thebest' : 'Премія: ',
        'thebestof100' : '100 кращих товарів України 2010 і 2011',
        // Контакты
        'wherefindus' : 'ТОВ «Виробничо-комерційна фірма «Еліт Пласт» 73000, Україна, м. Херсон, сел. Антонівка, вул 23 Східна, 41'

    },
    'ru' : {
        // Изменить кнопку языка
        'changelanguage' : 'RU',
        // Навигация
        'main' : 'Главная',
        'ofsuccess' : 'Арифметика успеха',
        'achievements' : 'Наши достижения',
        'contacts' : 'Контакты',
        'map' : 'Карта',
        // Хедер
        'weinsocial' : 'Мы в социальных сетях',
        'today' : 'Сегодня инновация -',
        'tomorrow' : 'завтра необходимость',
        'energy' : 'Энергосбережение нового поколения',
        // Арифметика успеха
        'territory' : 'Территория предприятия',
        'onthemarket' : 'на рынке ',
        'sevenyears' : '7 лет',
        'theyearof' : 'Годовой объем производства',
        // Сертификаты качества и премии
        'cert' : 'Сертификаты качества и премии',
        'thebest' : 'Премия: ',
        'thebestof100' : '100 лучших товаров Украины  2010 и 2011',
        // Контакты
        'wherefindus' : 'ООО «Производственно коммерческая фирма «Элит Пласт» 73000, Украина, г. Херсон, пос. Антоновка, ул 23 Восточная, 41'
    }

    };
 
$(function(){
    var c = document.cookie.match(/lang=(.+?)(?:;|$)/);
    var lang = c ? c[1] : "ru";
    delete c;
    $('.translate').click(function(){
        lang = $(this).attr('id');
        document.cookie="lang=" + lang + ";expire="+15552e6; // запоминаем на 30 дней
        $('.lang').each(function(index, element){
            $(this).text(arrLang[lang][$(this).attr('key')]);
        });
    });
    $('.lang').each(function(index, element){
        $(this).text(arrLang[lang][$(this).attr('key')]);
    });
});
 